def get_list():
    #Пример функции генератор
    for x in [1,2,3,4]:
        yield x

p = get_list()

for x in p:
    print(x, end=" ")
print('\n')

"""Функция генератор. расчитать среднее арифмитическое для последовательностей
1,2,3,4,5,6,7,8,9,10 = (1+2+3+4+5+6+7+8+9+10)/10 = 5.5
2,3,4,5,6,7,8,9,10
3,4,5,6,7,8,9,10
4,5,6,7,8,9,10
5,6,7,8,9,10
6,7,8,9,10
7,8,9,10
8,9,10
9,10
"""
def get_list2():
    #Пример функции генератор
    for i in range(1, 11):
        a = range(i, 11)
        yield sum(a) / len(a) #среднее арифмитическое

p2 = get_list2()
print(list(p2))